{
  "title": "CutandTag_Alignment_QC: A reproducible Snakemake workflow for alignment, quality control, and signal generation from Cut-and-Tag sequencing data.",
  "upload_type": "software",
  "description": "CutandTag_Alignment_QC is a Snakemake workflow designed to process Cut-and-Tag sequencing data to facilitate the analysis of chromatin accessibility and DNA-protein interactions. It uses raw FASTQs as input and includes automated steps for read alignment, quality control, signal track generation (raw and scaled), peak calling, and various visualizations, enabling high-resolution profiling of protein-DNA binding sites. The pipeline performs automated quality checks using FastQC, MultiQC, and FastQ Screen reports while also aligning reads with Bowtie2. Outputs include raw and scaled BigWig files, which allow users to visualize signal intensity across the genome. Additionally, peak calling is performed using MACS2, and fragment length and alignment summary plots are generated for detailed data exploration. The workflow is automated with Snakemake and dependencies are managed through module environments, ensuring reproducibility and flexibility.",
  "creators": [
    {
      "name": "Boyd, Kevin A.",
      "affiliation": "Oklahoma Medical Research Foundation",
      "orcid": "0000-0001-6739-8103"
    }
  ],
  "license": "Apache-2.0",
  "keywords": [
    "Cut-and-Tag",
    "Snakemake",
    "chromatin profiling",
    "MACS2",
    "Bowtie2",
    "FastQC",
    "FastQ Screen",
    "BigWig",
    "peak calling",
    "epigenomics",
    "bioinformatics",
    "workflow",
    "fragment length",
    "genomics",
    "open science"
  ],
  "related_identifiers": [
    {
      "identifier": "https://github.com/KirklandLab/CutandTag_Alignment_QC",
      "relation": "isSupplementTo",
      "scheme": "url"
    },
    {
      "identifier": "https://github.com/KirklandLab/CutandTag_ReplicatePeak_Analysis",
      "relation": "isPartOf",
      "scheme": "url"
    },
    {
      "identifier": "https://doi.org/10.17504/protocols.io.bjk2kkye",
      "relation": "isDerivedFrom",
      "scheme": "doi"
    }
  ]
}
